examples/dot/non_exhaustive_barrier_flat.dot
strict digraph "" {
    node [label="\N"];
    "Frame1" [label="Frame", shape=box];
    "Interval1" [label="100 ns", shape=box];
    "Waveform1" [label="ConstantWaveform", shape=box];
    "Waveform1" -> "Interval1"  [label="Duration", style=dashed];
    "Instruction2" [label="ModulatedPulse", shape=box];
    "Instruction2" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction2" -> "Waveform1"  [label="Envelope", style=dashed];
    "Radians2" [label="1 rad", shape=box];
    "Instruction2" -> "Radians2"  [label="PhaseOffset", style=dashed];
    "Instruction3" [label="ModulatedPulse", shape=box];
    "Instruction3" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction3" -> "Waveform1"  [label="Envelope", style=dashed];
    "Radians3" [label="1 rad", shape=box];
    "Instruction3" -> "Radians3"  [label="PhaseOffset", style=dashed];
    "Instruction4:Alignment" [label="EndToStart", shape=box];
    "Instruction4:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction4:Relationship" -> "Instruction4:Alignment"  [label="Alignment", style=dashed];
    "Instruction4" [label="Dependency", shape=box];
    "Instruction4" -> "Instruction4:Relationship"  [label="Relationship", style=dashed];
    "Instruction4" -> "Instruction2"  [label="Lhs", style=dashed];
    "Instruction4" -> "Instruction3"  [label="Rhs", style=dashed];
    "Frame2" [label="Frame", shape=box];
    "Interval4" [label="150 ns", shape=box];
    "Waveform2" [label="ConstantWaveform", shape=box];
    "Waveform2" -> "Interval4"  [label="Duration", style=dashed];
    "Instruction6" [label="ModulatedPulse", shape=box];
    "Instruction6" -> "Frame2"  [label="Frame", style=dashed];
    "Instruction6" -> "Waveform2"  [label="Envelope", style=dashed];
    "Radians5" [label="2 rad", shape=box];
    "Instruction6" -> "Radians5"  [label="PhaseOffset", style=dashed];
    "Instruction7" [label="ModulatedPulse", shape=box];
    "Instruction7" -> "Frame2"  [label="Frame", style=dashed];
    "Instruction7" -> "Waveform2"  [label="Envelope", style=dashed];
    "Radians6" [label="2 rad", shape=box];
    "Instruction7" -> "Radians6"  [label="PhaseOffset", style=dashed];
    "Instruction8:Alignment" [label="EndToStart", shape=box];
    "Instruction8:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction8:Relationship" -> "Instruction8:Alignment"  [label="Alignment", style=dashed];
    "Instruction8" [label="Dependency", shape=box];
    "Instruction8" -> "Instruction8:Relationship"  [label="Relationship", style=dashed];
    "Instruction8" -> "Instruction6"  [label="Lhs", style=dashed];
    "Instruction8" -> "Instruction7"  [label="Rhs", style=dashed];
    "Frame3" [label="Frame", shape=box];
    "Interval7" [label="50 ns", shape=box];
    "Waveform3" [label="ConstantWaveform", shape=box];
    "Waveform3" -> "Interval7"  [label="Duration", style=dashed];
    "Instruction10" [label="ModulatedPulse", shape=box];
    "Instruction10" -> "Frame3"  [label="Frame", style=dashed];
    "Instruction10" -> "Waveform3"  [label="Envelope", style=dashed];
    "Radians8" [label="3 rad", shape=box];
    "Instruction10" -> "Radians8"  [label="PhaseOffset", style=dashed];
    "Instruction11" [label="ModulatedPulse", shape=box];
    "Instruction11" -> "Frame3"  [label="Frame", style=dashed];
    "Instruction11" -> "Waveform3"  [label="Envelope", style=dashed];
    "Radians9" [label="3 rad", shape=box];
    "Instruction11" -> "Radians9"  [label="PhaseOffset", style=dashed];
    "Instruction12:Alignment" [label="EndToStart", shape=box];
    "Instruction12:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction12:Relationship" -> "Instruction12:Alignment"  [label="Alignment", style=dashed];
    "Instruction12" [label="Dependency", shape=box];
    "Instruction12" -> "Instruction12:Relationship"  [label="Relationship", style=dashed];
    "Instruction12" -> "Instruction10"  [label="Lhs", style=dashed];
    "Instruction12" -> "Instruction11"  [label="Rhs", style=dashed];
    "Instruction14" [label="ModulatedPulse", shape=box];
    "Instruction14" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction14" -> "Waveform1"  [label="Envelope", style=dashed];
    "Radians10" [label="1 rad", shape=box];
    "Instruction14" -> "Radians10"  [label="PhaseOffset", style=dashed];
    "Instruction15" [label="ModulatedPulse", shape=box];
    "Instruction15" -> "Frame2"  [label="Frame", style=dashed];
    "Instruction15" -> "Waveform2"  [label="Envelope", style=dashed];
    "Radians11" [label="2 rad", shape=box];
    "Instruction15" -> "Radians11"  [label="PhaseOffset", style=dashed];
    "Instruction16:Alignment" [label="EndToStart", shape=box];
    "Instruction16:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction16:Relationship" -> "Instruction16:Alignment"  [label="Alignment", style=dashed];
    "Instruction16" [label="Dependency", shape=box];
    "Instruction16" -> "Instruction16:Relationship"  [label="Relationship", style=dashed];
    "Instruction16" -> "Instruction14"  [label="Lhs", style=dashed];
    "Instruction16" -> "Instruction15"  [label="Rhs", style=dashed];
    "Instruction18" [label="ModulatedPulse", shape=box];
    "Instruction18" -> "Frame2"  [label="Frame", style=dashed];
    "Instruction18" -> "Waveform2"  [label="Envelope", style=dashed];
    "Radians12" [label="2 rad", shape=box];
    "Instruction18" -> "Radians12"  [label="PhaseOffset", style=dashed];
    "Instruction19" [label="ModulatedPulse", shape=box];
    "Instruction19" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction19" -> "Waveform1"  [label="Envelope", style=dashed];
    "Radians13" [label="1 rad", shape=box];
    "Instruction19" -> "Radians13"  [label="PhaseOffset", style=dashed];
    "Instruction20:Alignment" [label="EndToStart", shape=box];
    "Instruction20:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction20:Relationship" -> "Instruction20:Alignment"  [label="Alignment", style=dashed];
    "Instruction20" [label="Dependency", shape=box];
    "Instruction20" -> "Instruction20:Relationship"  [label="Relationship", style=dashed];
    "Instruction20" -> "Instruction18"  [label="Lhs", style=dashed];
    "Instruction20" -> "Instruction19"  [label="Rhs", style=dashed];
    "Instruction22" [label="ModulatedPulse", shape=box];
    "Instruction22" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction22" -> "Waveform1"  [label="Envelope", style=dashed];
    "Radians14" [label="1 rad", shape=box];
    "Instruction22" -> "Radians14"  [label="PhaseOffset", style=dashed];
    "Instruction23" [label="ModulatedPulse", shape=box];
    "Instruction23" -> "Frame3"  [label="Frame", style=dashed];
    "Instruction23" -> "Waveform3"  [label="Envelope", style=dashed];
    "Radians15" [label="3 rad", shape=box];
    "Instruction23" -> "Radians15"  [label="PhaseOffset", style=dashed];
    "Instruction24:Alignment" [label="EndToStart", shape=box];
    "Instruction24:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction24:Relationship" -> "Instruction24:Alignment"  [label="Alignment", style=dashed];
    "Instruction24" [label="Dependency", shape=box];
    "Instruction24" -> "Instruction24:Relationship"  [label="Relationship", style=dashed];
    "Instruction24" -> "Instruction22"  [label="Lhs", style=dashed];
    "Instruction24" -> "Instruction23"  [label="Rhs", style=dashed];
    "Instruction26" [label="ModulatedPulse", shape=box];
    "Instruction26" -> "Frame3"  [label="Frame", style=dashed];
    "Instruction26" -> "Waveform3"  [label="Envelope", style=dashed];
    "Radians16" [label="3 rad", shape=box];
    "Instruction26" -> "Radians16"  [label="PhaseOffset", style=dashed];
    "Instruction27" [label="ModulatedPulse", shape=box];
    "Instruction27" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction27" -> "Waveform1"  [label="Envelope", style=dashed];
    "Radians17" [label="1 rad", shape=box];
    "Instruction27" -> "Radians17"  [label="PhaseOffset", style=dashed];
    "Instruction28:Alignment" [label="EndToStart", shape=box];
    "Instruction28:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction28:Relationship" -> "Instruction28:Alignment"  [label="Alignment", style=dashed];
    "Instruction28" [label="Dependency", shape=box];
    "Instruction28" -> "Instruction28:Relationship"  [label="Relationship", style=dashed];
    "Instruction28" -> "Instruction26"  [label="Lhs", style=dashed];
    "Instruction28" -> "Instruction27"  [label="Rhs", style=dashed];
}
